const text = `Опыт работы с SCSS для создания стильных и адаптивных веб-дизайнов. Использую преимущества SCSS, такие как переменные, вложенные правила и миксины, для написания поддерживаемого и масштабируемого кода. Разработал стили для различных компонентов и страниц, обеспечивая единообразие и визуальную привлекательность.

Разработка современных одностраничных приложений с использованием React. Создаю компоненты, управляю состоянием с помощью хуков, таких как useState и useEffect, и организую сложные интерфейсы. Использую Redux для управления глобальным состоянием и React Router для маршрутизации. Опыт в создании адаптивных и отзывчивых UI, работа с REST и GraphQL API.

Разработка серверных рендеринговых приложений с использованием Next.js. Оптимизирую производительность и SEO с помощью статической генерации и серверного рендеринга. Создаю динамические маршруты, настраиваю конфигурацию и интегрирую API. Мои проекты включают блоги, электронные коммерческие платформы и корпоративные сайты с высокой производительностью и отличной пользовательской опытностью.`

export const biographyData ={
  img: '/me.webp',
  text: text
}

